Revit 2027 API
Definitions.Item Property
Retrieves a definition by a given name.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public Definition this[
	string name
] { get; }
Public ReadOnly Property Item (
	name As String
) As Definition
	Get
public:
property Definition^ Item[String^ name] {
	Definition^ get (String^ name);
}
member Item : Definition with get
Parameters
name String
The name of the parameter definition for which to search.
Property Value
Definition
Remarks
If the definition is not found then null will be returned.
See Also
Reference
Definitions Class
Autodesk.Revit.DB Namespace